samhodge-tokgan/Hastur/src/Sam3dBodyPipeline.cpp
// Copyright the Hastur authors.
// SPDX-License-Identifier: LicenseRef-SAM-License
#include "Sam3dBodyPipeline.h"
#include "ModelBytes.h"

#include <algorithm>
#include <array>
#include <chrono>
#include <cmath>
#include <cstdint>
#include <cstdio>
#include <cstdlib>
#include <filesystem>
#include <limits>
#include <string>
#include <vector>

#include <onnxruntime_cxx_api.h>

#include "CameraMatrix.h"
#include "CameraSolver.h"
#include "CropAffine.h"
#include "Cryptomatte.h"
#include "DetectorEngine.h"
#include "ExternalTracks.h"
#include "LeotardMask.h"
#include "SurfaceParam.h"
#include "HandRefinerEngine.h"
#include "MeshAssets.h"
#include "MhrModel.h"
#include "OrtSessionManager.h"
#include "Sam3dBodyEngine.h"
#include "SoftwareRasterizer.h"

namespace hastur {

namespace {

namespace fs = std::filesystem;

// Body-crop padding (reference: 1.25 for the body, 0.9 for hands).
constexpr float kBodyPad = 1.25f;
constexpr float kHandPad = 0.9f;

// 519-d pred slice offsets (MeshTypes.h layout).
constexpr int kShapeOff = kGlobal6D + kBodyCont;               // 266
constexpr int kScaleOff = kShapeOff + kShapeComps;             // 311
constexpr int kHandOff  = kScaleOff + kScaleComps;             // 339 (left54|right54)

// Reference thresholds (sam3d_body.run_inference).
constexpr float kWristAngleThresh = 1.4f;   // CRITERIA 1
constexpr float kHandBoxSizeThresh = 64.f;  // CRITERIA 2 (full-frame px)

// --- tiny row-major 3x3 helpers for the wrist-angle criterion ---------------
using Mat3 = std::array<float, 9>;
Mat3 Mat3MulT_A(const Mat3& a, const Mat3& b) {  // a^T * b
  Mat3 r{};
  for (int i = 0; i < 3; ++i)
    for (int j = 0; j < 3; ++j) {
      float s = 0.f;
      for (int k = 0; k < 3; ++k) s += a[k * 3 + i] * b[k * 3 + j];
      r[i * 3 + j] = s;
    }
  return r;
}
Mat3 Mat3Mul(const Mat3& a, const Mat3& b) {  // a * b
  Mat3 r{};
  for (int i = 0; i < 3; ++i)
    for (int j = 0; j < 3; ++j) {
      float s = 0.f;
      for (int k = 0; k < 3; ++k) s += a[i * 3 + k] * b[k * 3 + j];
      r[i * 3 + j] = s;
    }
  return r;
}
// rotation_angle_difference(A,B) = acos((trace(A B^T) - 1)/2).
float RotAngleDiff(const Mat3& A, const Mat3& B) {
  float tr = 0.f;
  for (int i = 0; i < 3; ++i)
    for (int k = 0; k < 3; ++k) tr += A[i * 3 + k] * B[i * 3 + k];  // A . B (== A B^T trace)
  float c = (tr - 1.f) * 0.5f;
  if (c > 1.f) c = 1.f;
  if (c < -1.f) c = -1.f;
  return std::acos(c);
}

// Path-list separator: ';' on Windows so a drive-lettered dir like "F:/models"
// is NOT split at its colon (which left person_detector.onnx unfound -> silent
// passthrough); ':' on POSIX. Must match ModelSearchPath's join separator.
#ifdef _WIN32
constexpr char kPathListSep = ';';
#else
constexpr char kPathListSep = ':';
#endif

// Split a separator-delimited search path into existing directories, then append
// $HASTUR_MODEL_DIR (also separated) so an env override always applies.
std::vector<std::string> SearchDirs(const std::string& model_dir) {
  std::vector<std::string> dirs;
  auto push_split = [&](const std::string& s) {
    size_t i = 0;
    while (i <= s.size()) {
      size_t j = s.find(kPathListSep, i);
      if (j == std::string::npos) j = s.size();
      if (j > i) dirs.emplace_back(s.substr(i, j - i));
      i = j + 1;
    }
  };
  push_split(model_dir);
  if (const char* env = std::getenv("HASTUR_MODEL_DIR")) push_split(env);
  return dirs;
}

// First existing `dir/name` across the search dirs, else empty.
std::string FindFile(const std::vector<std::string>& dirs, const std::string& name) {
  for (const std::string& d : dirs) {
    std::error_code ec;
    fs::path p = fs::path(d) / name;
    if (fs::exists(p, ec)) return p.string();
  }
  return {};
}

float Sigmoid(float x) { return 1.f / (1.f + std::exp(-x)); }

// Coarse per-stage timing, printed to stderr only when HASTUR_PIPELINE_TIMING
// is set. Cheap std::chrono; zero cost when the env var is absent.
using Clock = std::chrono::steady_clock;
bool TimingOn() {
  static const bool on = std::getenv("HASTUR_PIPELINE_TIMING") != nullptr;
  return on;
}
double Ms(Clock::time_point a, Clock::time_point b) {
  return std::chrono::duration<double, std::milli>(b - a).count();
}
void LogStage(const char* name, double ms) {
  if (TimingOn()) std::fprintf(stderr, "[hastur-timing] %-18s %8.1f ms\n", name, ms);
}

// Over-composite `fg` (premultiplied RGBA) on top of `acc` (premultiplied),
// both W*H*4. acc is modified in place. Standard Porter-Duff "over".
void OverComposite(std::vector<float>& acc, const std::vector<float>& fg) {
  const size_t n = acc.size();
  for (size_t i = 0; i + 3 < n; i += 4) {
    const float fa = fg[i + 3];
    const float inv = 1.f - fa;
    acc[i + 0] = fg[i + 0] + acc[i + 0] * inv;
    acc[i + 1] = fg[i + 1] + acc[i + 1] * inv;
    acc[i + 2] = fg[i + 2] + acc[i + 2] * inv;
    acc[i + 3] = fa + acc[i + 3] * inv;
  }
}

// Clean a native detector mask IN PLACE before it becomes Cryptomatte coverage.
// The raw sigmoid carries background speckle, interior mottling/pepper holes, and
// a very soft edge. Three conservative passes at native resolution:
//   1. floor    — coverage < kFloor -> 0 (removes faint background speckle).
//   2. hole-fill — flood-fill "outside" from the border over the NOT-solid set
//                  (< kSolid); any not-solid pixel NOT reached is an ENCLOSED
//                  interior hole and is raised to full. Genuine boundary
//                  concavities (gaps between splayed fingers, hair) stay
//                  connected to the border and are preserved — unlike a blunt
//                  morphological close, which would round that detail off.
//   3. edge gain — smoothstep the transition to firm the silhouette while
//                  KEEPING a soft fractional band (Cryptomatte wants fractional
//                  coverage, not a hard binary).
// Skipped entirely if HASTUR_MASK_NOCLEAN is set (raw-sigmoid A/B).
void CleanDetMask(DetMask& m) {
  if (m.w <= 0 || m.h <= 0 ||
      m.data.size() != static_cast<size_t>(m.w) * m.h)
    return;
  static const bool kNoClean = std::getenv("HASTUR_MASK_NOCLEAN") != nullptr;
  if (kNoClean) return;
  const int W = m.w, H = m.h;
  const size_t N = static_cast<size_t>(W) * H;
  float* d = m.data.data();
  constexpr float kFloor = 0.04f;  // below this = background
  constexpr float kSolid = 0.50f;  // "inside" threshold for hole detection
  constexpr float kLo = 0.15f, kHi = 0.85f;  // edge-gain smoothstep band

