samhodge-tokgan/Hastur/src/Sam3dBodyPipeline.cpp
  // 1. floor
  for (size_t i = 0; i < N; ++i)
    if (d[i] < kFloor) d[i] = 0.f;

  // 2. enclosed-hole fill via border flood-fill over the not-solid set.
  std::vector<uint8_t> outside(N, 0);
  std::vector<int> stack;
  stack.reserve(N / 4 + 1);
  auto push = [&](int x, int y) {
    const size_t i = static_cast<size_t>(y) * W + x;
    if (!outside[i] && d[i] < kSolid) { outside[i] = 1; stack.push_back(static_cast<int>(i)); }
  };
  for (int x = 0; x < W; ++x) { push(x, 0); push(x, H - 1); }
  for (int y = 0; y < H; ++y) { push(0, y); push(W - 1, y); }
  while (!stack.empty()) {
    const int i = stack.back(); stack.pop_back();
    const int x = i % W, y = i / W;
    if (x > 0) push(x - 1, y);
    if (x < W - 1) push(x + 1, y);
    if (y > 0) push(x, y - 1);
    if (y < H - 1) push(x, y + 1);
  }
  for (size_t i = 0; i < N; ++i)
    if (d[i] < kSolid && !outside[i]) d[i] = 1.f;  // interior hole -> fill

  // 3. mild edge gain (smoothstep), keeping a soft anti-aliased band.
  for (size_t i = 0; i < N; ++i) {
    float t = (d[i] - kLo) / (kHi - kLo);
    t = std::clamp(t, 0.f, 1.f);
    d[i] = t * t * (3.f - 2.f * t);
  }
}

// Bilinear-upsample a native single-channel detector mask (m.w x m.h sigmoid
// coverage) to full frame W*H, row-major. The instance mask covers the same
// (stretched) frame the detector processed, so this is a direct resample — no
// pad/offset (SAM 3 uses stretch-to-square, HASTUR_DET_STRETCH). Returns empty
// if the mask is absent. The soft sigmoid edge becomes anti-aliased coverage.
std::vector<float> UpsampleMaskToFrame(const DetMask& m, int W, int H) {
  std::vector<float> out;
  if (m.w <= 0 || m.h <= 0 || W <= 0 || H <= 0 ||
      m.data.size() != static_cast<size_t>(m.w) * m.h)
    return out;
  out.assign(static_cast<size_t>(W) * H, 0.f);
  const float sx = m.w > 1 && W > 1 ? static_cast<float>(m.w - 1) / (W - 1) : 0.f;
  const float sy = m.h > 1 && H > 1 ? static_cast<float>(m.h - 1) / (H - 1) : 0.f;
  for (int y = 0; y < H; ++y) {
    float fy = y * sy;
    int y0 = static_cast<int>(fy);
    int y1 = std::min(y0 + 1, m.h - 1);
    float wy = fy - y0;
    for (int x = 0; x < W; ++x) {
      float fx = x * sx;
      int x0 = static_cast<int>(fx);
      int x1 = std::min(x0 + 1, m.w - 1);
      float wx = fx - x0;
      const float* r0 = m.data.data() + static_cast<size_t>(y0) * m.w;
      const float* r1 = m.data.data() + static_cast<size_t>(y1) * m.w;
      float top = r0[x0] * (1 - wx) + r0[x1] * wx;
      float bot = r1[x0] * (1 - wx) + r1[x1] * wx;
      out[static_cast<size_t>(y) * W + x] = top * (1 - wy) + bot * wy;
    }
  }
  return out;
}

}  // namespace

struct Sam3dBodyPipeline::Impl {
  bool loaded = false;
  bool ok = false;

  // Fixed at first load.
  std::string model_dir;
  ComputeUnits units = ComputeUnits::All;

  std::unique_ptr<DetectorEngine> det;
  std::unique_ptr<Sam3dBodyEngine> body;
  std::shared_ptr<MeshAssets> assets;
  std::unique_ptr<MhrModel> mhr;

  // Static per-vertex garment mask (kNumVerts, 1 = leotard, 0 = skin), computed
  // once at load from the rest-pose landmarks. Empty -> garment disabled.
  std::vector<float> leotard_mask;

  // Static per-vertex surface parametrisation for the Pref/ST AOVs, computed once
  // at load from the canonical base_shape (shot-invariant). pref_norm is the
  // canonical body position normalised to [0,1]^3; st_uv is a cylindrical UV
  // unwrap used only when the assets carry no real "uv" block.
  std::vector<float> pref_norm;     // kNumVerts*3, [0,1]
  std::vector<float> st_uv;         // kNumVerts*2, cylindrical fallback
  std::vector<float> rest_normals;  // kNumVerts*3, bind-pose normals (Nref AOV)

  // M7 hand refiner: located at load, created lazily on the first gated hand.
  std::string hand_path;                        // empty -> refinement disabled
  std::unique_ptr<HandRefinerEngine> hand;      // lazy
  bool hand_tried = false;                      // attempted lazy creation
  int intra_threads = 0;

  // joint_rotation[wrist_twist] rotmats for CRITERIA 1: [0]=left(joint77),
  // [1]=right(joint41), row-major 3x3. Loaded from mhr_wrist.bin if present;
  // when absent the wrist-angle criterion is skipped (box-size gate only).
  bool wrist_loaded = false;
  std::array<std::array<float, 9>, 2> joint_rotation_wrist{};

  // --- Temporally stable person IDs (Cryptomatte) -------------------------
  // Persistent track table mapping a person's metric 3D position (cam_t) to a
  // stable id across Run() calls, so the Cryptomatte name person_NN follows one
  // physical person on a sequence instead of resetting to a per-frame ordinal.
  // Updated every frame; reset when a new pass/sequence is detected (time jumps
  // backward or far forward). Pruned so vanished people don't linger forever.
  struct Track {
    int id;
    float cam_t[3];
    double last_time;
  };
  std::vector<Track> tracks;
  int next_track_id = 0;
  double trk_last_time = -1e18;   // last processed host time (< -1e17 = unset)

  // Assign a stable track id to each person by nearest-cam_t association against
  // the persistent table, using the frame time to gate/reset. Returns per-person
  // ids aligned to `people` (people order = detector score-descending).
  std::vector<int> AssignTrackIds(const std::vector<PersonResult>& people,
                                  double time);

  // Refine the gated hands of `person` in place (updates person.pred.pred and
  // person.has_hands to reflect which hands were actually merged). Returns true
  // if any hand was merged (caller re-runs the MHR mesh on the updated pred).
  bool RefineHands(PersonResult& person, const float* rgb, int W, int H,
                   const CamInt& K, const PipelineParams& p);

  // Pose-corrective session, owned via the shared-env manager.
  std::unique_ptr<OrtSessionManager> ort;
  std::shared_ptr<OrtSessionManager::Handle> pose;
  std::string pose_in_name, pose_out_name;

  // Run pose_corrective.onnx: joint_parameters[889] -> offset[kNumVerts*3]
  // (cm, pre-flip). Returns false (offset untouched) on any failure.
  bool RunPoseCorrective(const std::array<float, 889>& jp,
                         std::vector<float>& offset);
};

Sam3dBodyPipeline::Sam3dBodyPipeline() : impl_(std::make_unique<Impl>()) {}
Sam3dBodyPipeline::~Sam3dBodyPipeline() = default;

