samhodge-tokgan/Hastur/src/Sam3dBodyPipeline.cpp
bool Sam3dBodyPipeline::ok() const { return impl_ && impl_->ok; }

bool Sam3dBodyPipeline::EnsureLoaded(const PipelineParams& p) {
  Impl& s = *impl_;
  if (s.loaded) return s.ok;
  s.loaded = true;
  s.model_dir = p.model_dir;
  s.units = p.units;

  const std::vector<std::string> dirs = SearchDirs(p.model_dir);

  const std::string det_path = FindFile(dirs, "person_detector.onnx");
  const std::string body_path = FindFile(dirs, "sam3dbody_body.onnx");
  const std::string assets_path = FindFile(dirs, "mhr_assets.bin");
  const std::string pose_path = FindFile(dirs, "pose_corrective.onnx");
  // Hand refiner is OPTIONAL: absence just disables 2nd-pass refinement.
  s.hand_path = FindFile(dirs, "sam3dbody_hand.onnx");
  s.intra_threads = p.intra_threads;

  std::string missing;
  // The person detector is not needed when boxes come from external tracks; only
  // require it for the internal detection path. (It is still loaded when present,
  // so toggling the tracks param off within a session keeps working.)
  if (det_path.empty() && !p.use_external_tracks) missing += " person_detector.onnx";
  if (body_path.empty()) missing += " sam3dbody_body.onnx";
  if (assets_path.empty()) missing += " mhr_assets.bin";
  if (pose_path.empty()) missing += " pose_corrective.onnx";
  if (!missing.empty()) {
    last_error_ = "model/asset files not found:" + missing +
                  " (set HASTUR_MODEL_DIR or the model-dir param)";
    return false;
  }

  try {
    // Load the detector when its ONNX is present (skipped only when external
    // tracks are active AND no detector model was supplied).
    if (!det_path.empty())
      s.det = std::make_unique<DetectorEngine>(det_path, p.units, p.intra_threads);
    s.body = std::make_unique<Sam3dBodyEngine>(body_path, p.units, p.intra_threads);
    // mhr_assets.bin is a shipped model asset and is sealed with the rest, so
    // it is read through the same path-to-bytes helper as the graphs.
    s.assets = MeshAssets::LoadFromBytes(hastur::LoadModelBytes(assets_path),
                                         assets_path);
    s.mhr = std::make_unique<MhrModel>(s.assets);

    // Pose-corrective: dense fp32 matmul — run it on CPU (fast, avoids a
    // multi-hundred-MB CoreML compile), on the shared env.
    s.ort = std::make_unique<OrtSessionManager>("HasturPipeline");
    s.pose = s.ort->MakeSession(pose_path, p.units, Ep::Cpu, /*gpu_mem_limit=*/0,
                                /*lazy=*/false);
    Ort::Session& psess = s.pose->Get();  // throws if unavailable
    Ort::AllocatorWithDefaultOptions alloc;
    s.pose_in_name = psess.GetInputNameAllocated(0, alloc).get();
    s.pose_out_name = psess.GetOutputNameAllocated(0, alloc).get();
  } catch (const std::exception& e) {
    last_error_ = std::string("session/asset load failed: ") + e.what();
    return false;
  }

  // Optional wrist-twist joint_rotation constants for the wrist-angle criterion
  // (mhr_wrist.bin = 18 float32: left joint77 rotmat(9), right joint41 rotmat(9)).
  const std::string wrist_path = FindFile(dirs, "mhr_wrist.bin");
  if (!wrist_path.empty()) {
    std::error_code ec;
    auto sz = fs::file_size(wrist_path, ec);
    if (!ec && sz == sizeof(float) * 18) {
      std::FILE* f = std::fopen(wrist_path.c_str(), "rb");
      if (f) {
        float buf[18];
        if (std::fread(buf, sizeof(float), 18, f) == 18) {
          for (int i = 0; i < 9; ++i) {
            s.joint_rotation_wrist[0][i] = buf[i];
            s.joint_rotation_wrist[1][i] = buf[9 + i];
          }
          s.wrist_loaded = true;
        }
        std::fclose(f);
      }
    }
  }

  // Static garment (leotard) mask from the rest-pose landmarks — one identity
  // mesh eval, done once. Non-fatal: on any failure the garment simply stays
  // disabled (the mesh renders as plain neutral clay).
  try {
    std::array<float, kParamDim> zero_pred{};
    const Mesh rest = s.mhr->Run(zero_pred, /*pose_corrective=*/nullptr);
    s.leotard_mask = ComputeLeotardMask(rest);
    // Bind-pose normals (Nref AOV) from the same rest mesh (verts + faces).
    if (rest.faces && !rest.verts.empty()) {
      const int nfaces = static_cast<int>(rest.faces->size() / 3);
      s.rest_normals = ComputeRestNormals(rest.verts.data(), rest.faces->data(),
                                          kNumVerts, nfaces);
    }
  } catch (...) {
    s.leotard_mask.clear();
    s.rest_normals.clear();
  }

  // Surface parametrisation for the Pref/ST AOVs, from the canonical base_shape
  // (once, at load). pref_norm is always computed; st_uv (cylindrical fallback)
  // only when the assets carry no real "uv" block. Non-fatal.
  try {
    if (s.assets && s.assets->has("base_shape")) {
      const float* base = s.assets->f32("base_shape");  // (kNumVerts,3) cm, pre-flip
      s.pref_norm = ComputePrefNormalized(base, kNumVerts);
      if (!s.assets->has("uv")) s.st_uv = ComputeCylindricalUV(base, kNumVerts);
    }
  } catch (...) {
    s.pref_norm.clear();
    s.st_uv.clear();
  }

  s.ok = true;
  return true;
}

bool Sam3dBodyPipeline::Impl::RunPoseCorrective(const std::array<float, 889>& jp,
                                                std::vector<float>& offset) {
  Sam3dBodyPipeline::Impl& s = *this;
  Ort::Session* psess = s.pose ? s.pose->TryGet() : nullptr;
  if (!psess) return false;
  try {
    Ort::MemoryInfo mem =
        Ort::MemoryInfo::CreateCpu(OrtArenaAllocator, OrtMemTypeDefault);
    std::array<int64_t, 2> ishape{1, 889};
    // CreateTensor needs a non-const data pointer.
    std::array<float, 889> jp_copy = jp;
    Ort::Value in = Ort::Value::CreateTensor<float>(
        mem, jp_copy.data(), jp_copy.size(), ishape.data(), ishape.size());
    const char* in_names[] = {s.pose_in_name.c_str()};
    const char* out_names[] = {s.pose_out_name.c_str()};
    std::vector<Ort::Value> r = psess->Run(Ort::RunOptions{nullptr}, in_names, &in,
                                           1, out_names, 1);
    if (r.empty() || !r[0].IsTensor()) return false;
    const size_t want = static_cast<size_t>(kNumVerts) * 3;
    if (r[0].GetTensorTypeAndShapeInfo().GetElementCount() < want) return false;
    const float* out = r[0].GetTensorData<float>();
    offset.assign(out, out + want);
    return true;
  } catch (const std::exception&) {
    return false;
  }
}

// M7 hand refiner. Mirrors the per-hand building block of sam3d_body.run_inference:
// crop each gated hand from hand_box (pad 0.9), run the hand decoder, gate on the
// wrist-angle + hand-box-size criteria, and merge the refined hand PCA / scale /
// shape into the body pred[519] via the reference's replace_hands_in_pose logic.
//
// Conventions that must be exact:
//   * hand_box[side] = [cx, cy, w, h] normalized to [0,1] of the 512 BODY crop;
//     side 0 = LEFT, 1 = RIGHT. Mapped to a full-frame square box via the body
//     crop's inverse affine, then re-cropped (pad 0.9) as its own 512 hand crop.
//   * L/R FLIP: the left hand is cropped from a HORIZONTALLY-MIRRORED frame (box
//     x also mirrored) so it is processed exactly like a right hand. The hand
//     decoder's RIGHT-slot output (hand[54:108]) is therefore the refined hand for
//     BOTH crops; for the left it becomes the body's LEFT slot (hand[0:54]).
//   * pred[519] hand block = [left54 | right54] at kHandOff.
bool Sam3dBodyPipeline::Impl::RefineHands(PersonResult& person, const float* rgb,
                                          int W, int H, const CamInt& K,
                                          const PipelineParams& p) {
  Impl& s = *this;
  if (s.hand_path.empty()) return false;

