samhodge-tokgan/Hastur/src/Sam3dBodyPipeline.cpp
  // Lazy engine creation on the first gated hand of the whole frame.
  if (!s.hand && !s.hand_tried) {
    s.hand_tried = true;
    try {
      s.hand = std::make_unique<HandRefinerEngine>(s.hand_path, s.units,
                                                   s.intra_threads);
      if (!s.hand->ok()) {
        std::fprintf(stderr, "[hastur] hand refiner load failed: %s\n",
                     s.hand->last_error().c_str());
        s.hand.reset();
        s.hand_path.clear();  // don't retry every person
      }
    } catch (const std::exception& e) {
      std::fprintf(stderr, "[hastur] hand refiner exception: %s\n", e.what());
      s.hand.reset();
      s.hand_path.clear();
    }
  }
  if (!s.hand) return false;

  const std::array<float, kParamDim>& bpred = person.pred.pred;

  // Body crop affine (frame<->crop) for placing hand boxes back in the frame.
  CropInputs bcrop = MakeCrop(rgb, W, H, person.box, K, kBodyPad);
  const std::array<float, 6>& inv = bcrop.affine_inv;   // crop px -> frame px
  const float crop_per_frame = bcrop.affine[0];         // frame -> crop scale

  // Scale-flip constants (left hand crop is processed as a right hand).
  const float* scale_mean = s.assets->f32("scale_mean");    // (68,)
  const float* scale_comps = s.assets->f32("scale_comps");  // (28,68)
  const float sr_mean = scale_mean[8], sl_mean = scale_mean[9];
  const float sr_std = scale_comps[8 * 68 + 8], sl_std = scale_comps[9 * 68 + 9];

  // Wrist-angle gate geometry from the BODY pred (CRITERIA 1).
  MhrModel::WristGate wg = s.mhr->ComputeWristGate(bpred);

  // Lazily built mirrored frame (only if a left hand is refined).
  std::vector<float> flipped;

  // Per-side accumulation for the shared-shape/scale averaging.
  bool apply[2] = {false, false};
  std::array<float, 54> hand54[2]{};
  float hand_scale_coeff[2] = {0, 0};             // body pred scale[8]/[9]
  std::array<float, 10> shared_scale[2]{};        // pred scale[18:28]
  std::array<float, 5> shared_shape[2]{};         // pred shape[40:45]

  const int S = kBodyImageSize;

  for (int side = 0; side < 2; ++side) {
    const std::array<float, 4>& hb = person.pred.hand_box[side];  // cx,cy,w,h [0,1]
    const float cx_c = hb[0] * S, cy_c = hb[1] * S;               // crop px
    const float wpx_c = hb[2] * S, hpx_c = hb[3] * S;
    const float sq_c = std::max(wpx_c, hpx_c);                    // square, crop px
    if (sq_c <= 1.f) continue;

    // CRITERIA 2: hand box size in full-frame px must exceed the threshold.
    const float sq_frame = sq_c / std::max(crop_per_frame, 1e-6f);
    const bool box_ok = sq_frame > kHandBoxSizeThresh;
    if (!box_ok) continue;

    // Hand box center in full-frame px (crop -> frame via the body inverse affine).
    const float fx = inv[0] * cx_c + inv[1] * cy_c + inv[2];
    const float fy = inv[3] * cx_c + inv[4] * cy_c + inv[5];
    const float half = 0.5f * sq_frame;

    CropInputs hc;
    if (side == 0) {
      // LEFT: mirror the frame and the box so it is processed like a right hand.
      if (flipped.empty()) {
        flipped.assign(static_cast<size_t>(W) * H * 3, 0.f);
        for (int y = 0; y < H; ++y)
          for (int x = 0; x < W; ++x) {
            const float* src = rgb + (static_cast<size_t>(y) * W + (W - 1 - x)) * 3;
            float* dst = &flipped[(static_cast<size_t>(y) * W + x) * 3];
            dst[0] = src[0]; dst[1] = src[1]; dst[2] = src[2];
          }
      }
      const float fxm = (W - 1) - fx;
      BBox hbox{fxm - half, fy - half, fxm + half, fy + half, person.box.score};
      hc = MakeCrop(flipped.data(), W, H, hbox, K, kHandPad);
    } else {
      BBox hbox{fx - half, fy - half, fx + half, fy + half, person.box.score};
      hc = MakeCrop(rgb, W, H, hbox, K, kHandPad);
    }

    HandPrediction hp = s.hand->Run(hc);
    if (!hp.valid) continue;

    // Refined hand for THIS crop is always the decoder's RIGHT slot (hand[54:108]).
    for (int i = 0; i < 54; ++i) hand54[side][i] = hp.pred[kHandOff + 54 + i];

    // Hand scale coefficient: right crop -> body scale[8]; left crop -> body
    // scale[9] via the flip formula.
    const float rc8 = hp.pred[kScaleOff + 8];
    hand_scale_coeff[side] =
        (side == 0) ? (((sr_mean + sr_std * rc8) - sl_mean) / sl_std) : rc8;

    for (int i = 0; i < 10; ++i) shared_scale[side][i] = hp.pred[kScaleOff + 18 + i];
    for (int i = 0; i < 5; ++i) shared_shape[side][i] = hp.pred[kShapeOff + 40 + i];

    // Predicted GLOBAL wrist rotmat for this hand: decoder joint 42 (right slot).
    // For the left crop, un-flip it (negate rows 1,2) to get the body-left wrist.
    Mat3 pred_wrist = hp.wrist_global[1];
    if (side == 0)
      for (int r = 1; r < 3; ++r)
        for (int c = 0; c < 3; ++c) pred_wrist[r * 3 + c] *= -1.f;

    // CRITERIA 1: wrist-angle. fused_local = wrist_zero^T * pred_wrist, where
    // wrist_zero = lowarm_global * joint_rotation[wrist_twist]. Compare its angle
    // to the body decoder's own local wrist rotation. Skipped (pass) when the
    // joint_rotation constants are unavailable.
    bool angle_ok = true;
    float ang = -1.f;
    if (s.wrist_loaded) {
      Mat3 wrist_zero = Mat3Mul(wg.lowarm_global[side], s.joint_rotation_wrist[side]);
      Mat3 fused = Mat3MulT_A(wrist_zero, pred_wrist);
      ang = RotAngleDiff(wg.ori_local[side], fused);
      angle_ok = ang < kWristAngleThresh;
    }
    if (std::getenv("HASTUR_HAND_DEBUG")) {
      std::fprintf(stderr,
                   "[hastur-hand] side=%d(%s) sq_frame=%.1fpx box_ok=%d "
                   "wrist_loaded=%d angle=%.3frad angle_ok=%d\n",
                   side, side ? "R" : "L", sq_frame, box_ok, s.wrist_loaded,
                   ang, angle_ok);
    }
    // HASTUR_HAND_FORCE bypasses the wrist-angle criterion (box-size gate only).
    if (!angle_ok && !std::getenv("HASTUR_HAND_FORCE")) continue;

    apply[side] = true;
  }

  if (!apply[0] && !apply[1]) {
    person.has_hands = false;  // nothing merged after gating
    return false;
  }

  // --- merge into the body pred[519] (replace_hands_in_pose) ------------------
  std::array<float, kParamDim>& pred = person.pred.pred;
  if (apply[0])  // left
    for (int i = 0; i < 54; ++i) pred[kHandOff + i] = hand54[0][i];
  if (apply[1])  // right
    for (int i = 0; i < 54; ++i) pred[kHandOff + 54 + i] = hand54[1][i];
  if (apply[0]) pred[kScaleOff + 9] = hand_scale_coeff[0];
  if (apply[1]) pred[kScaleOff + 8] = hand_scale_coeff[1];

  // Shared scale[18:28] / shape[40:45]: mean of the applied hands (reference
  // weights each by its validity).
  const float denom = (apply[0] ? 1.f : 0.f) + (apply[1] ? 1.f : 0.f);
  if (denom > 0.f) {
    for (int i = 0; i < 10; ++i) {
      float v = 0.f;
      if (apply[0]) v += shared_scale[0][i];
      if (apply[1]) v += shared_scale[1][i];
      pred[kScaleOff + 18 + i] = v / denom;
    }
    for (int i = 0; i < 5; ++i) {
      float v = 0.f;
      if (apply[0]) v += shared_shape[0][i];
      if (apply[1]) v += shared_shape[1][i];
      pred[kShapeOff + 40 + i] = v / denom;
    }
  }
  return true;
}

std::vector<int> Sam3dBodyPipeline::Impl::AssignTrackIds(
    const std::vector<PersonResult>& people, double time) {
  std::vector<int> ids(people.size(), -1);
  // Association gate on 3D distance (metres). It grows with the frame gap so a
  // person briefly missed still re-links, and stays tight frame-to-frame.
  constexpr float kGateBase = 0.7f;     // per-frame gate
  constexpr float kGatePerGap = 0.25f;  // widen per missed frame
  constexpr double kMaxGap = 45.0;      // frames a track may vanish, then pruned
  constexpr double kResetGap = 90.0;    // time jump that means "new pass" -> reset

