samhodge-tokgan/Hastur/src/Sam3dBodyPipeline.cpp
  const double dt = (trk_last_time < -1e17) ? 1.0 : (time - trk_last_time);
  if (dt < -0.5 || dt > kResetGap) {    // scrubbed backward / jumped -> new pass
    tracks.clear();
    next_track_id = 0;
  }
  const double gap = std::max(1.0, std::fabs(dt));
  const float gate = kGateBase + kGatePerGap * static_cast<float>(gap - 1.0);

  std::vector<char> used(tracks.size(), 0);
  // Greedy nearest assignment. people is score-descending, so the most confident
  // detections claim their tracks first.
  for (size_t pi = 0; pi < people.size(); ++pi) {
    const float* c = people[pi].cam.cam_t.data();
    int best = -1;
    float best_d = gate;
    for (size_t ti = 0; ti < tracks.size(); ++ti) {
      if (used[ti]) continue;
      const float* tc = tracks[ti].cam_t;
      const float dx = c[0] - tc[0], dy = c[1] - tc[1], dz = c[2] - tc[2];
      const float d = std::sqrt(dx * dx + dy * dy + dz * dz);
      if (d < best_d) { best_d = d; best = static_cast<int>(ti); }
    }
    if (best >= 0) {
      used[best] = 1;
      ids[pi] = tracks[best].id;
      for (int k = 0; k < 3; ++k) tracks[best].cam_t[k] = c[k];
      tracks[best].last_time = time;
    } else {
      Track nt;
      nt.id = next_track_id++;
      for (int k = 0; k < 3; ++k) nt.cam_t[k] = c[k];
      nt.last_time = time;
      tracks.push_back(nt);
      used.push_back(1);
      ids[pi] = nt.id;
    }
  }
  // Prune tracks unseen for a while so the table doesn't grow without bound.
  tracks.erase(std::remove_if(tracks.begin(), tracks.end(),
                              [&](const Track& t) {
                                return time - t.last_time > kMaxGap;
                              }),
               tracks.end());
  trk_last_time = time;
  return ids;
}

FrameResult Sam3dBodyPipeline::Run(const float* rgb, int W, int H,
                                   const PipelineParams& p) {
  FrameResult result;
  result.render.width = W;
  result.render.height = H;
  result.render.data.assign(static_cast<size_t>(W) * H * 4, 0.f);
  if (!rgb || W <= 0 || H <= 0) {
    last_error_ = "invalid input frame";
    return result;
  }
  if (!EnsureLoaded(p)) return result;
  Impl& s = *impl_;

  // Camera intrinsics for the whole frame (shared by conditioning + projection).
  const CamInt K = DefaultCamInt(
      W, H, p.override_camera ? p.fov_override_deg : 0.f,
      p.override_camera ? p.focal_override : 0.f);

  // --- Stage 1: person detection ------------------------------------------
  // SAM 3-mask Cryptomatte coverage needs per-detection instance masks; request
  // them only when AOVs + a mask-based coverage mode are active (zero cost else,
  // and a no-op if the detector ONNX emits no mask output). det_masks[i] aligns
  // 1:1 with dets[i], hence with result.people[i] below.
  const bool want_masks =
      p.emit_aovs && p.crypto_coverage != CryptoCoverage::Mesh;
  std::vector<DetMask> det_masks;
  Detections dets;
  // Pre-assigned stable ids when driving from external tracks; -1 => use the
  // detector + cam_t association path below. Aligned 1:1 with dets/people.
  std::vector<int> ext_ids;
  auto t0 = Clock::now();
  if (p.use_external_tracks) {
    // Boxes + stable ids (and optional masks) come from the upstream tracker; the
    // internal detector and AssignTrackIds() are bypassed entirely. Each frame is
    // self-contained, so ordering/statefulness no longer matter.
    std::vector<ExternalTrack> trk =
        LoadExternalTracks(p.tracks_path, std::lround(p.time), want_masks);
    dets.reserve(trk.size());
    ext_ids.reserve(trk.size());
    if (want_masks) det_masks.reserve(trk.size());
    for (ExternalTrack& t : trk) {
      dets.push_back(t.box);
      ext_ids.push_back(t.id);
      if (want_masks) det_masks.push_back(std::move(t.mask));
    }
    LogStage("external-tracks", Ms(t0, Clock::now()));
  } else {
    if (!s.det) {  // external tracks were on at load time and no detector model
      last_error_ = "no detector loaded (set a model dir, or supply person tracks)";
      return result;
    }
    dets = s.det->Run(rgb, W, H, p.detector_score_thresh,
                      want_masks ? &det_masks : nullptr);
    LogStage("detector", Ms(t0, Clock::now()));
  }
  if (dets.empty()) {
    last_error_ =
        p.use_external_tracks ? "no tracks for this frame" : "no persons detected";
    return result;  // valid (empty) frame; host passes source through
  }

  // External tracks carry their own (already de-duplicated) person set, so the
  // per-frame max_people cap does not apply — dropping tracker people would break
  // stable ids and the depth composite. The internal path keeps the cap.
  const int max_people = std::max(1, p.max_people);
  const int n_people = p.use_external_tracks
                           ? static_cast<int>(dets.size())
                           : std::min(static_cast<int>(dets.size()), max_people);

  RasterOptions ropt;
  ropt.grey = p.grey;
  ropt.ssaa = std::max(1, p.ssaa);
  ropt.premultiply = true;  // composite in premultiplied space internally
  ropt.garment = p.garment && !s.leotard_mask.empty();
  for (int k = 0; k < 3; ++k) {
    ropt.leotard_rgb[k] = p.leotard_rgb[k];
    ropt.skin_rgb[k] = p.skin_rgb[k];
  }

  // --- Per-person: pass 1 (serial GPU chain) then pass 2 (parallel CPU mesh) -------
  // The body regressor / hand refiner / pose-corrective run on the single GPU (and the
  // hand refiner lazily creates its engine), so pass 1 stays serial. The MHR mesh
  // FK/LBS is pure CPU, const and independent, so it parallelizes across people in
  // pass 2 (each writes its own result.people[i].mesh — no shared state, deterministic).
  result.people.resize(n_people);
  std::vector<std::vector<float>> pose_corr(n_people);
  std::vector<char> have_pose_corr(n_people, 0);

  for (int i = 0; i < n_people; ++i) {
    PersonResult& person = result.people[i];
    person.box = dets[i];
    if (p.use_external_tracks && i < static_cast<int>(ext_ids.size()))
      person.track_id = ext_ids[i];

