samhodge-tokgan/Hastur/src/Sam3dBodyPipeline.cpp
    // 2. crop + camera conditioning.
    auto tc = Clock::now();
    CropInputs crop = MakeCrop(rgb, W, H, person.box, K, kBodyPad);
    LogStage("crop", Ms(tc, Clock::now()));

    // 3. body regressor.
    auto tb = Clock::now();
    person.pred = s.body->Run(crop);
    LogStage("body-regressor", Ms(tb, Clock::now()));

    // 3b. hand-presence gate: sigmoid over the per-hand logits.
    bool any_hand = false;
    for (int h = 0; h < 2; ++h) {
      const float logit =
          std::max(person.pred.hand_logits[h][0], person.pred.hand_logits[h][1]);
      if (Sigmoid(logit) > p.hand_tau) any_hand = true;
    }
    person.has_hands = any_hand;

    // 3c. M7 hand refiner (gated). Lazily creates its engine -> keep serial.
    if (any_hand) {
      auto th = Clock::now();
      const bool merged = s.RefineHands(person, rgb, W, H, K, p);
      LogStage("hand-refine", Ms(th, Clock::now()));
      (void)merged;
    }

    // 4. pose-corrective ONNX -> per-vertex offsets (cm, pre-flip); stash for pass 2.
    auto tp = Clock::now();
    std::array<float, 889> jp = s.mhr->JointParameters(person.pred.pred);
    std::vector<float> pc;
    const bool have_pc = s.RunPoseCorrective(jp, pc);
    LogStage("pose-corrective", Ms(tp, Clock::now()));
    pose_corr[i] = std::move(pc);
    have_pose_corr[i] = have_pc ? 1 : 0;

    // 6. perspective camera solve (body default_scale = 1).
    person.cam = PerspectiveProjection(person.pred.pred_cam, person.box, kBodyPad, K,
                                        /*default_scale=*/1.f);
  }

  // 5. MHR mesh (C++ FK+LBS) — parallel across people (pure CPU, independent).
  {
    auto tm = Clock::now();
#pragma omp parallel for schedule(dynamic)
    for (int i = 0; i < n_people; ++i)
      result.people[i].mesh =
          s.mhr->Run(result.people[i].pred.pred,
                     have_pose_corr[i] ? pose_corr[i].data() : nullptr);
    LogStage("mhr-mesh", Ms(tm, Clock::now()));
  }

  if (result.people.empty()) {
    last_error_ = "no person meshes produced";
    return result;
  }

  // Stable per-person Cryptomatte identity: match each person to a persistent
  // track by nearest 3D position (cam_t) so person_NN names one physical person
  // across the sequence. Falls back to the per-frame depth ordinal when off.
  // External tracks already carry stable ids (set in the loop above); only the
  // internal detector path needs the cam_t association.
  if (p.stable_person_ids && !p.use_external_tracks) {
    std::vector<int> ids = s.AssignTrackIds(result.people, p.time);
    for (size_t i = 0; i < result.people.size() && i < ids.size(); ++i)
      result.people[i].track_id = ids[i];
  }

  // --- 7. depth-ordered over-composite ------------------------------------
  // Paint far first, near last (near occludes far). cam_t.z is metric depth
  // (>0 in front); larger z = farther.
  std::vector<int> order(result.people.size());
  for (size_t i = 0; i < order.size(); ++i) order[i] = static_cast<int>(i);
  std::sort(order.begin(), order.end(), [&](int a, int b) {
    return result.people[a].cam.cam_t[2] > result.people[b].cam.cam_t[2];
  });

  // AOV setup: a shared canonical Pref attribute (base_shape, transformed into the
  // posed mesh frame: cm->m and the [1,2] axis flip, matching MhrModel's output)
  // and, when a UV set exists, the ST attribute. Both are per-vertex and shared
  // across people (topology/vertex order are identical for every person).
  VertAttrib attrib;
  // Garment mask (static per-vertex, computed once at load) — drives the beauty
  // albedo, so it is always supplied (not gated on AOV emission).
  if (ropt.garment) attrib.leotardness = s.leotard_mask.data();
  // Pref (normalised canonical position) and ST (uv) are computed once at load.
  // Prefer a real "uv" asset block if present; else use the cylindrical unwrap.
  const float* uv_src = nullptr;
  if (s.assets && s.assets->has("uv"))
    uv_src = s.assets->f32("uv");
  else if (!s.st_uv.empty())
    uv_src = s.st_uv.data();
  const bool st_available = p.emit_aovs && uv_src != nullptr;
  if (p.emit_aovs) {
    attrib.pref = s.pref_norm.empty() ? nullptr : s.pref_norm.data();
    attrib.nref = s.rest_normals.empty() ? nullptr : s.rest_normals.data();
    attrib.uv = uv_src;
  }
  std::vector<RasterAov> person_aov(p.emit_aovs ? result.people.size() : 0);
  // Pass the attribute whenever AOVs are requested OR the garment needs its mask.
  const bool pass_attrib = p.emit_aovs || attrib.leotardness != nullptr;

  auto tr = Clock::now();
  std::vector<float>& acc = result.render.data;  // premultiplied accumulator
  for (int idx : order) {
    const PersonResult& person = result.people[idx];
    if (person.mesh.verts.empty()) continue;
    RasterAov* aptr = p.emit_aovs ? &person_aov[idx] : nullptr;
    RgbaImage r = Render(person.mesh, person.cam, W, H, ropt, aptr,
                         pass_attrib ? &attrib : nullptr);
    if (static_cast<int>(r.data.size()) != W * H * 4) continue;
    OverComposite(acc, r.data);  // r is premultiplied (ropt.premultiply=true)
  }
  LogStage("raster+composite", Ms(tr, Clock::now()));

  // acc is premultiplied. If the caller wants straight (un-associated) alpha,
  // un-premultiply the colour.
  if (!p.premultiply) {
    for (size_t i = 0; i + 3 < acc.size(); i += 4) {
      const float a = acc[i + 3];
      if (a > 1e-6f) {
        acc[i + 0] /= a;
        acc[i + 1] /= a;
        acc[i + 2] /= a;
      }
    }
  }

  // --- 8. AOV assembly (optional) -----------------------------------------
  if (p.emit_aovs) {
    auto ta = Clock::now();
    const size_t n1 = static_cast<size_t>(W) * H;
    AovBuffers& av = result.aovs;
    av.width = W;
    av.height = H;
    av.has_st = st_available;
    av.depth.assign(n1, 0.f);
    av.position.assign(n1 * 3, 0.f);
    av.normal.assign(n1 * 3, 0.f);
    av.pref.assign(n1 * 3, 0.f);
    const bool nref_available = !s.rest_normals.empty();
    av.nref.assign(nref_available ? n1 * 3 : 0, 0.f);
    av.st.assign(st_available ? n1 * 2 : 0, 0.f);
    av.coverage.assign(n1, 0.f);
    av.matte.assign(n1, 0.f);

