samhodge-tokgan/Hastur/src/Sam3dBodyPipeline.cpp
    // Merge per-person data by nearest depth (a true cross-person z-buffer: the
    // frontmost surface at each pixel wins the point sample).
    std::vector<float> best_z(n1, std::numeric_limits<float>::infinity());
    for (const RasterAov& a : person_aov) {
      if (a.coverage.size() != n1) continue;
      for (size_t px = 0; px < n1; ++px) {
        if (a.coverage[px] <= 0.f) continue;
        const float z = a.depth[px];
        if (z <= 0.f || z >= best_z[px]) continue;
        best_z[px] = z;
        av.depth[px] = z;
        for (int k = 0; k < 3; ++k) {
          av.position[px * 3 + k] = a.position[px * 3 + k];
          av.normal[px * 3 + k] = a.normal[px * 3 + k];
          av.pref[px * 3 + k] = a.pref[px * 3 + k];
        }
        if (nref_available && a.nref.size() == n1 * 3)
          for (int k = 0; k < 3; ++k) av.nref[px * 3 + k] = a.nref[px * 3 + k];
        if (st_available)
          for (int k = 0; k < 2; ++k) av.st[px * 2 + k] = a.st[px * 2 + k];
      }
    }
    // Coverage AOV == final composited alpha.
    for (size_t px = 0; px < n1; ++px) av.coverage[px] = acc[px * 4 + 3];

    // Retain per-person {alpha,pref,depth} (aligned to result.people) for downstream
    // consumers (Rotobot-Next topology bridge). Move out of person_aov — the merge
    // above already consumed them. Only the three needed buffers are kept.
    if (p.retain_person_aovs) {
      result.person_aovs.resize(person_aov.size());
      for (size_t i = 0; i < person_aov.size(); ++i) {
        result.person_aovs[i].width = W;
        result.person_aovs[i].height = H;
        result.person_aovs[i].coverage = std::move(person_aov[i].coverage);
        result.person_aovs[i].pref = std::move(person_aov[i].pref);
        result.person_aovs[i].nref = std::move(person_aov[i].nref);
        result.person_aovs[i].depth = std::move(person_aov[i].depth);
      }
    }

    // Cryptomatte: persons front-to-back (near first = reverse of paint order).
    std::vector<CryptoPerson> cps;
    cps.reserve(order.size());
    int rank = 0;
    for (auto it = order.rbegin(); it != order.rend(); ++it) {
      RasterAov& a = person_aov[*it];
      const bool have_mesh = a.coverage.size() == n1;

      // SAM 3 instance mask (upsampled to frame), when a mask-based coverage
      // mode is active and this person has a detector mask.
      std::vector<float> mask_cov;
      if (p.crypto_coverage != CryptoCoverage::Mesh &&
          static_cast<size_t>(*it) < det_masks.size()) {
        CleanDetMask(det_masks[*it]);  // floor + enclosed-hole fill + edge gain
        mask_cov = UpsampleMaskToFrame(det_masks[*it], W, H);
      }
      const bool have_mask = mask_cov.size() == n1;

      // Pick the coverage matte per mode. Sam3Mask falls back to the mesh
      // silhouette when a mask is missing; Both = per-pixel union (max).
      std::vector<float> cov;
      switch (p.crypto_coverage) {
        case CryptoCoverage::Sam3Mask:
          if (have_mask) cov = std::move(mask_cov);
          else if (have_mesh) cov = std::move(a.coverage);
          break;
        case CryptoCoverage::Both:
          if (have_mesh) {
            cov = std::move(a.coverage);
            if (have_mask)
              for (size_t px = 0; px < n1; ++px)
                cov[px] = std::max(cov[px], mask_cov[px]);
          } else if (have_mask) {
            cov = std::move(mask_cov);
          }
          break;
        case CryptoCoverage::Mesh:
        default:
          if (have_mesh) cov = std::move(a.coverage);
          break;
      }
      if (cov.size() != n1) continue;  // no usable coverage for this person

      // Prefer the stable track id (person follows across frames); fall back to
      // the per-frame depth ordinal when stable ids are disabled/unavailable.
      const int pid =
          (result.people[*it].track_id >= 0) ? result.people[*it].track_id : rank;
      ++rank;
      char nm[16];
      std::snprintf(nm, sizeof(nm), "person_%02d", pid);
      // Matte AOV: accumulate the per-pixel union (max) of every person's
      // coverage before it's moved into the Cryptomatte person.
      for (size_t px = 0; px < n1; ++px)
        if (cov[px] > av.matte[px]) av.matte[px] = cov[px];
      CryptoPerson cp;
      cp.name = nm;
      cp.coverage = std::move(cov);
      cps.push_back(std::move(cp));
    }
    result.crypto = BuildCryptomatte(W, H, "person", cps, p.crypto_levels);

    // Frame-level camera matrices (m44f) from the shared intrinsics.
    result.camera = BuildCameraMatrices(CamFocalX(K), CamCx(K), CamCy(K), W, H,
                                        p.near_z, p.far_z);
    LogStage("aov-assembly", Ms(ta, Clock::now()));
  }

  last_error_.clear();
  return result;
}

std::vector<int32_t> Sam3dBodyPipeline::JointParents() const {
  return impl_->mhr ? impl_->mhr->JointParents() : std::vector<int32_t>{};
}

}  // namespace hastur
